TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
       3                    ;* Date/Time created: Wed Nov 02 14:57:38 2022                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\CE2007\Lab1_C_Programming\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("Clock_Delay1ms")

     796                            .dwpsn  file "../main.c",line 228,column 1,is_stmt,address Volatile_KeyWord,isa 1
     797                    
     798                            .dwfde $C$DW$CIE, Volatile_KeyWord
     799                    
     800                    ;*****************************************************************************
     801                    ;* FUNCTION NAME: Volatile_KeyWord                                           *
     802                    ;*                                                                           *
     803                    ;*   Regs Modified     :                                                     *
     804                    ;*   Regs Used         : LR                                                  *
     805                    ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
     806                    ;*****************************************************************************
     807 00000132           Volatile_KeyWord:
     808                    ;* --------------------------------------------------------------------------*
     809                            .dwcfi  cfa_offset, 0
     810                            .dwpsn  file "../main.c",line 234,column 5,is_stmt,isa 1
     811                            .dwpsn  file "../main.c",line 241,column 1,is_stmt,isa 1
     812                    $C$DW$42        .dwtag  DW_TAG_TI_branch
     813                            .dwattr $C$DW$42, DW_AT_low_pc(0x00)
     814                            .dwattr $C$DW$42, DW_AT_TI_return
     815                    
     816 00000132 4770              BX        LR                    ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     817                            ; BRANCH OCCURS                  ; [] 
     818                            .dwattr $C$DW$41, DW_AT_TI_end_file("../main.c")
     819                            .dwattr $C$DW$41, DW_AT_TI_end_line(0xf1)
     820                            .dwattr $C$DW$41, DW_AT_TI_end_column(0x01)
     821                            .dwendentry
     822                            .dwendtag $C$DW$41
     823                    
     824                    ;******************************************************************************
     825                    ;* CONSTANT TABLE                                                             *
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   16

     826                    ;******************************************************************************
     827 00000134                   .sect   ".text"
     828                            .align  4
     829 00000134 40004C0C  ||$C$CON2||:    .bits   1073761292,32
     830                            .align  4
     831 00000138 40004C02  ||$C$CON5||:    .bits   1073761282,32
     832                            .align  4
     833 0000013c 40004C03  ||$C$CON11||:   .bits   1073761283,32
     834                            .align  4
     835 00000140 00000000! ||$C$CON12||:   .bits   ||$P$T0$1||,32
     836                    ;*****************************************************************************
     837                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     838                    ;*****************************************************************************
     839                            .global Clock_Delay1ms
     840                    
     841                    ;******************************************************************************
     842                    ;* BUILD ATTRIBUTES                                                           *
     843                    ;******************************************************************************
     844                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     845                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     846                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     847                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     848                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     849                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     850                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     851                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     852                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(3)
     853                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     854                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     855                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     856                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     857                    
     858                    ;******************************************************************************
     859                    ;* TYPE INFORMATION                                                           *
     860                    ;******************************************************************************
     861                    
     862                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     863                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e)
     864                    $C$DW$43        .dwtag  DW_TAG_member
     865                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$20)
     866                            .dwattr $C$DW$43, DW_AT_name("IN")
     867                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("IN")
     868                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     870                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     871                            .dwattr $C$DW$43, DW_AT_decl_line(0x288)
     872                            .dwattr $C$DW$43, DW_AT_decl_column(0x0f)
     873                    
     874                    $C$DW$44        .dwtag  DW_TAG_member
     875                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     876                            .dwattr $C$DW$44, DW_AT_name("RESERVED0")
     877                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("RESERVED0")
     878                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     879                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     880                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   17

     881                            .dwattr $C$DW$44, DW_AT_decl_line(0x289)
     882                            .dwattr $C$DW$44, DW_AT_decl_column(0x0b)
     883                    
     884                    $C$DW$45        .dwtag  DW_TAG_member
     885                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$21)
     886                            .dwattr $C$DW$45, DW_AT_name("OUT")
     887                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("OUT")
     888                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     889                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     890                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     891                            .dwattr $C$DW$45, DW_AT_decl_line(0x28a)
     892                            .dwattr $C$DW$45, DW_AT_decl_column(0x10)
     893                    
     894                    $C$DW$46        .dwtag  DW_TAG_member
     895                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     896                            .dwattr $C$DW$46, DW_AT_name("RESERVED1")
     897                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("RESERVED1")
     898                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     899                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     900                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     901                            .dwattr $C$DW$46, DW_AT_decl_line(0x28b)
     902                            .dwattr $C$DW$46, DW_AT_decl_column(0x0b)
     903                    
     904                    $C$DW$47        .dwtag  DW_TAG_member
     905                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$21)
     906                            .dwattr $C$DW$47, DW_AT_name("DIR")
     907                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("DIR")
     908                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     909                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     910                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     911                            .dwattr $C$DW$47, DW_AT_decl_line(0x28c)
     912                            .dwattr $C$DW$47, DW_AT_decl_column(0x10)
     913                    
     914                    $C$DW$48        .dwtag  DW_TAG_member
     915                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     916                            .dwattr $C$DW$48, DW_AT_name("RESERVED2")
     917                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("RESERVED2")
     918                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     919                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     920                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     921                            .dwattr $C$DW$48, DW_AT_decl_line(0x28d)
     922                            .dwattr $C$DW$48, DW_AT_decl_column(0x0b)
     923                    
     924                    $C$DW$49        .dwtag  DW_TAG_member
     925                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     926                            .dwattr $C$DW$49, DW_AT_name("REN")
     927                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("REN")
     928                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     929                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     930                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     931                            .dwattr $C$DW$49, DW_AT_decl_line(0x28e)
     932                            .dwattr $C$DW$49, DW_AT_decl_column(0x10)
     933                    
     934                    $C$DW$50        .dwtag  DW_TAG_member
     935                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   18

     936                            .dwattr $C$DW$50, DW_AT_name("RESERVED3")
     937                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("RESERVED3")
     938                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     939                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     940                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     941                            .dwattr $C$DW$50, DW_AT_decl_line(0x28f)
     942                            .dwattr $C$DW$50, DW_AT_decl_column(0x0b)
     943                    
     944                    $C$DW$51        .dwtag  DW_TAG_member
     945                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     946                            .dwattr $C$DW$51, DW_AT_name("DS")
     947                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DS")
     948                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     949                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     950                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     951                            .dwattr $C$DW$51, DW_AT_decl_line(0x290)
     952                            .dwattr $C$DW$51, DW_AT_decl_column(0x10)
     953                    
     954                    $C$DW$52        .dwtag  DW_TAG_member
     955                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     956                            .dwattr $C$DW$52, DW_AT_name("RESERVED4")
     957                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("RESERVED4")
     958                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     959                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     960                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     961                            .dwattr $C$DW$52, DW_AT_decl_line(0x291)
     962                            .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     963                    
     964                    $C$DW$53        .dwtag  DW_TAG_member
     965                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     966                            .dwattr $C$DW$53, DW_AT_name("SEL0")
     967                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("SEL0")
     968                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     969                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     970                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     971                            .dwattr $C$DW$53, DW_AT_decl_line(0x292)
     972                            .dwattr $C$DW$53, DW_AT_decl_column(0x10)
     973                    
     974                    $C$DW$54        .dwtag  DW_TAG_member
     975                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     976                            .dwattr $C$DW$54, DW_AT_name("RESERVED5")
     977                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED5")
     978                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     979                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     980                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     981                            .dwattr $C$DW$54, DW_AT_decl_line(0x293)
     982                            .dwattr $C$DW$54, DW_AT_decl_column(0x0b)
     983                    
     984                    $C$DW$55        .dwtag  DW_TAG_member
     985                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     986                            .dwattr $C$DW$55, DW_AT_name("SEL1")
     987                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("SEL1")
     988                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     989                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     990                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   19

     991                            .dwattr $C$DW$55, DW_AT_decl_line(0x294)
     992                            .dwattr $C$DW$55, DW_AT_decl_column(0x10)
     993                    
     994                    $C$DW$56        .dwtag  DW_TAG_member
     995                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     996                            .dwattr $C$DW$56, DW_AT_name("RESERVED6")
     997                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED6")
     998                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     999                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1000                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1001                            .dwattr $C$DW$56, DW_AT_decl_line(0x295)
    1002                            .dwattr $C$DW$56, DW_AT_decl_column(0x0b)
    1003                    
    1004                    $C$DW$57        .dwtag  DW_TAG_member
    1005                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$23)
    1006                            .dwattr $C$DW$57, DW_AT_name("IV")
    1007                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("IV")
    1008                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1009                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1010                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1011                            .dwattr $C$DW$57, DW_AT_decl_line(0x296)
    1012                            .dwattr $C$DW$57, DW_AT_decl_column(0x11)
    1013                    
    1014                    $C$DW$58        .dwtag  DW_TAG_member
    1015                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$24)
    1016                            .dwattr $C$DW$58, DW_AT_name("RESERVED7")
    1017                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("RESERVED7")
    1018                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1019                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1020                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1021                            .dwattr $C$DW$58, DW_AT_decl_line(0x297)
    1022                            .dwattr $C$DW$58, DW_AT_decl_column(0x0b)
    1023                    
    1024                    $C$DW$59        .dwtag  DW_TAG_member
    1025                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
    1026                            .dwattr $C$DW$59, DW_AT_name("SELC")
    1027                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("SELC")
    1028                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1029                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1030                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1031                            .dwattr $C$DW$59, DW_AT_decl_line(0x298)
    1032                            .dwattr $C$DW$59, DW_AT_decl_column(0x10)
    1033                    
    1034                    $C$DW$60        .dwtag  DW_TAG_member
    1035                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1036                            .dwattr $C$DW$60, DW_AT_name("RESERVED8")
    1037                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("RESERVED8")
    1038                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1039                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1040                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1041                            .dwattr $C$DW$60, DW_AT_decl_line(0x299)
    1042                            .dwattr $C$DW$60, DW_AT_decl_column(0x0b)
    1043                    
    1044                    $C$DW$61        .dwtag  DW_TAG_member
    1045                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   20

    1046                            .dwattr $C$DW$61, DW_AT_name("IES")
    1047                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("IES")
    1048                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1049                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1050                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1051                            .dwattr $C$DW$61, DW_AT_decl_line(0x29a)
    1052                            .dwattr $C$DW$61, DW_AT_decl_column(0x10)
    1053                    
    1054                    $C$DW$62        .dwtag  DW_TAG_member
    1055                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1056                            .dwattr $C$DW$62, DW_AT_name("RESERVED9")
    1057                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED9")
    1058                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1059                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1060                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1061                            .dwattr $C$DW$62, DW_AT_decl_line(0x29b)
    1062                            .dwattr $C$DW$62, DW_AT_decl_column(0x0b)
    1063                    
    1064                    $C$DW$63        .dwtag  DW_TAG_member
    1065                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
    1066                            .dwattr $C$DW$63, DW_AT_name("IE")
    1067                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("IE")
    1068                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1069                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1070                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1071                            .dwattr $C$DW$63, DW_AT_decl_line(0x29c)
    1072                            .dwattr $C$DW$63, DW_AT_decl_column(0x10)
    1073                    
    1074                    $C$DW$64        .dwtag  DW_TAG_member
    1075                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1076                            .dwattr $C$DW$64, DW_AT_name("RESERVED10")
    1077                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED10")
    1078                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1079                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1080                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1081                            .dwattr $C$DW$64, DW_AT_decl_line(0x29d)
    1082                            .dwattr $C$DW$64, DW_AT_decl_column(0x0b)
    1083                    
    1084                    $C$DW$65        .dwtag  DW_TAG_member
    1085                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
    1086                            .dwattr $C$DW$65, DW_AT_name("IFG")
    1087                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("IFG")
    1088                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1089                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1090                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1091                            .dwattr $C$DW$65, DW_AT_decl_line(0x29e)
    1092                            .dwattr $C$DW$65, DW_AT_decl_column(0x10)
    1093                    
    1094                    $C$DW$66        .dwtag  DW_TAG_member
    1095                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1096                            .dwattr $C$DW$66, DW_AT_name("RESERVED11")
    1097                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("RESERVED11")
    1098                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1099                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1100                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   21

    1101                            .dwattr $C$DW$66, DW_AT_decl_line(0x29f)
    1102                            .dwattr $C$DW$66, DW_AT_decl_column(0x0b)
    1103                    
    1104                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1105                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x287)
    1106                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1107                            .dwendtag $C$DW$T$25
    1108                    
    1109                    $C$DW$T$172     .dwtag  DW_TAG_typedef
    1110                            .dwattr $C$DW$T$172, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    1111                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$25)
    1112                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    1113                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1114                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x2a0)
    1115                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
    1116                    
    1117                    
    1118                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1119                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
    1120                    $C$DW$67        .dwtag  DW_TAG_member
    1121                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1122                            .dwattr $C$DW$67, DW_AT_name("RESERVED0")
    1123                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("RESERVED0")
    1124                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1126                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1127                            .dwattr $C$DW$67, DW_AT_decl_line(0x2a3)
    1128                            .dwattr $C$DW$67, DW_AT_decl_column(0x0b)
    1129                    
    1130                    $C$DW$68        .dwtag  DW_TAG_member
    1131                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
    1132                            .dwattr $C$DW$68, DW_AT_name("IN")
    1133                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("IN")
    1134                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1135                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1136                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1137                            .dwattr $C$DW$68, DW_AT_decl_line(0x2a4)
    1138                            .dwattr $C$DW$68, DW_AT_decl_column(0x0f)
    1139                    
    1140                    $C$DW$69        .dwtag  DW_TAG_member
    1141                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1142                            .dwattr $C$DW$69, DW_AT_name("RESERVED1")
    1143                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("RESERVED1")
    1144                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1145                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1146                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1147                            .dwattr $C$DW$69, DW_AT_decl_line(0x2a5)
    1148                            .dwattr $C$DW$69, DW_AT_decl_column(0x0b)
    1149                    
    1150                    $C$DW$70        .dwtag  DW_TAG_member
    1151                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1152                            .dwattr $C$DW$70, DW_AT_name("OUT")
    1153                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("OUT")
    1154                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1155                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1156                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1157                            .dwattr $C$DW$70, DW_AT_decl_line(0x2a6)
    1158                            .dwattr $C$DW$70, DW_AT_decl_column(0x10)
    1159                    
    1160                    $C$DW$71        .dwtag  DW_TAG_member
    1161                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1162                            .dwattr $C$DW$71, DW_AT_name("RESERVED2")
    1163                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED2")
    1164                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1165                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1166                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1167                            .dwattr $C$DW$71, DW_AT_decl_line(0x2a7)
    1168                            .dwattr $C$DW$71, DW_AT_decl_column(0x0b)
    1169                    
    1170                    $C$DW$72        .dwtag  DW_TAG_member
    1171                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
    1172                            .dwattr $C$DW$72, DW_AT_name("DIR")
    1173                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("DIR")
    1174                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1175                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1176                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1177                            .dwattr $C$DW$72, DW_AT_decl_line(0x2a8)
    1178                            .dwattr $C$DW$72, DW_AT_decl_column(0x10)
    1179                    
    1180                    $C$DW$73        .dwtag  DW_TAG_member
    1181                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1182                            .dwattr $C$DW$73, DW_AT_name("RESERVED3")
    1183                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED3")
    1184                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1185                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1186                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1187                            .dwattr $C$DW$73, DW_AT_decl_line(0x2a9)
    1188                            .dwattr $C$DW$73, DW_AT_decl_column(0x0b)
    1189                    
    1190                    $C$DW$74        .dwtag  DW_TAG_member
    1191                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1192                            .dwattr $C$DW$74, DW_AT_name("REN")
    1193                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("REN")
    1194                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1195                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1196                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1197                            .dwattr $C$DW$74, DW_AT_decl_line(0x2aa)
    1198                            .dwattr $C$DW$74, DW_AT_decl_column(0x10)
    1199                    
    1200                    $C$DW$75        .dwtag  DW_TAG_member
    1201                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1202                            .dwattr $C$DW$75, DW_AT_name("RESERVED4")
    1203                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED4")
    1204                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1205                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1206                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1207                            .dwattr $C$DW$75, DW_AT_decl_line(0x2ab)
    1208                            .dwattr $C$DW$75, DW_AT_decl_column(0x0b)
    1209                    
    1210                    $C$DW$76        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1211                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
    1212                            .dwattr $C$DW$76, DW_AT_name("DS")
    1213                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("DS")
    1214                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1215                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1216                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1217                            .dwattr $C$DW$76, DW_AT_decl_line(0x2ac)
    1218                            .dwattr $C$DW$76, DW_AT_decl_column(0x10)
    1219                    
    1220                    $C$DW$77        .dwtag  DW_TAG_member
    1221                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1222                            .dwattr $C$DW$77, DW_AT_name("RESERVED5")
    1223                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED5")
    1224                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1225                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1226                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1227                            .dwattr $C$DW$77, DW_AT_decl_line(0x2ad)
    1228                            .dwattr $C$DW$77, DW_AT_decl_column(0x0b)
    1229                    
    1230                    $C$DW$78        .dwtag  DW_TAG_member
    1231                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
    1232                            .dwattr $C$DW$78, DW_AT_name("SEL0")
    1233                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("SEL0")
    1234                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1235                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1236                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1237                            .dwattr $C$DW$78, DW_AT_decl_line(0x2ae)
    1238                            .dwattr $C$DW$78, DW_AT_decl_column(0x10)
    1239                    
    1240                    $C$DW$79        .dwtag  DW_TAG_member
    1241                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1242                            .dwattr $C$DW$79, DW_AT_name("RESERVED6")
    1243                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED6")
    1244                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1245                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1246                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1247                            .dwattr $C$DW$79, DW_AT_decl_line(0x2af)
    1248                            .dwattr $C$DW$79, DW_AT_decl_column(0x0b)
    1249                    
    1250                    $C$DW$80        .dwtag  DW_TAG_member
    1251                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1252                            .dwattr $C$DW$80, DW_AT_name("SEL1")
    1253                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("SEL1")
    1254                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1255                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1256                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1257                            .dwattr $C$DW$80, DW_AT_decl_line(0x2b0)
    1258                            .dwattr $C$DW$80, DW_AT_decl_column(0x10)
    1259                    
    1260                    $C$DW$81        .dwtag  DW_TAG_member
    1261                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$26)
    1262                            .dwattr $C$DW$81, DW_AT_name("RESERVED7")
    1263                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED7")
    1264                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1265                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1266                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1267                            .dwattr $C$DW$81, DW_AT_decl_line(0x2b1)
    1268                            .dwattr $C$DW$81, DW_AT_decl_column(0x0b)
    1269                    
    1270                    $C$DW$82        .dwtag  DW_TAG_member
    1271                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1272                            .dwattr $C$DW$82, DW_AT_name("SELC")
    1273                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("SELC")
    1274                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1275                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1276                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1277                            .dwattr $C$DW$82, DW_AT_decl_line(0x2b2)
    1278                            .dwattr $C$DW$82, DW_AT_decl_column(0x10)
    1279                    
    1280                    $C$DW$83        .dwtag  DW_TAG_member
    1281                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1282                            .dwattr $C$DW$83, DW_AT_name("RESERVED8")
    1283                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED8")
    1284                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1285                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1286                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1287                            .dwattr $C$DW$83, DW_AT_decl_line(0x2b3)
    1288                            .dwattr $C$DW$83, DW_AT_decl_column(0x0b)
    1289                    
    1290                    $C$DW$84        .dwtag  DW_TAG_member
    1291                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1292                            .dwattr $C$DW$84, DW_AT_name("IES")
    1293                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("IES")
    1294                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1295                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1296                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1297                            .dwattr $C$DW$84, DW_AT_decl_line(0x2b4)
    1298                            .dwattr $C$DW$84, DW_AT_decl_column(0x10)
    1299                    
    1300                    $C$DW$85        .dwtag  DW_TAG_member
    1301                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1302                            .dwattr $C$DW$85, DW_AT_name("RESERVED9")
    1303                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED9")
    1304                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1305                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1306                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1307                            .dwattr $C$DW$85, DW_AT_decl_line(0x2b5)
    1308                            .dwattr $C$DW$85, DW_AT_decl_column(0x0b)
    1309                    
    1310                    $C$DW$86        .dwtag  DW_TAG_member
    1311                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1312                            .dwattr $C$DW$86, DW_AT_name("IE")
    1313                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("IE")
    1314                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1315                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1316                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1317                            .dwattr $C$DW$86, DW_AT_decl_line(0x2b6)
    1318                            .dwattr $C$DW$86, DW_AT_decl_column(0x10)
    1319                    
    1320                    $C$DW$87        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1321                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1322                            .dwattr $C$DW$87, DW_AT_name("RESERVED10")
    1323                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("RESERVED10")
    1324                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1325                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1326                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1327                            .dwattr $C$DW$87, DW_AT_decl_line(0x2b7)
    1328                            .dwattr $C$DW$87, DW_AT_decl_column(0x0b)
    1329                    
    1330                    $C$DW$88        .dwtag  DW_TAG_member
    1331                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1332                            .dwattr $C$DW$88, DW_AT_name("IFG")
    1333                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("IFG")
    1334                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1335                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1336                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1337                            .dwattr $C$DW$88, DW_AT_decl_line(0x2b8)
    1338                            .dwattr $C$DW$88, DW_AT_decl_column(0x10)
    1339                    
    1340                    $C$DW$89        .dwtag  DW_TAG_member
    1341                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$23)
    1342                            .dwattr $C$DW$89, DW_AT_name("IV")
    1343                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("IV")
    1344                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1345                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1346                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1347                            .dwattr $C$DW$89, DW_AT_decl_line(0x2b9)
    1348                            .dwattr $C$DW$89, DW_AT_decl_column(0x10)
    1349                    
    1350                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1351                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2a2)
    1352                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1353                            .dwendtag $C$DW$T$27
    1354                    
    1355                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1356                            .dwattr $C$DW$T$174, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    1357                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$27)
    1358                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1359                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1360                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x2ba)
    1361                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x03)
    1362                    
    1363                    
    1364                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1365                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1366                    $C$DW$90        .dwtag  DW_TAG_member
    1367                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$28)
    1368                            .dwattr $C$DW$90, DW_AT_name("_reserved0")
    1369                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("_reserved0")
    1370                            .dwattr $C$DW$90, DW_AT_bit_offset(0x10)
    1371                            .dwattr $C$DW$90, DW_AT_bit_size(0x10)
    1372                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1374                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1375                            .dwattr $C$DW$90, DW_AT_decl_line(0x105)
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1376                            .dwattr $C$DW$90, DW_AT_decl_column(0x0e)
    1377                    
    1378                    $C$DW$91        .dwtag  DW_TAG_member
    1379                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$28)
    1380                            .dwattr $C$DW$91, DW_AT_name("GE")
    1381                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("GE")
    1382                            .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
    1383                            .dwattr $C$DW$91, DW_AT_bit_size(0x04)
    1384                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1386                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1387                            .dwattr $C$DW$91, DW_AT_decl_line(0x106)
    1388                            .dwattr $C$DW$91, DW_AT_decl_column(0x0e)
    1389                    
    1390                    $C$DW$92        .dwtag  DW_TAG_member
    1391                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$28)
    1392                            .dwattr $C$DW$92, DW_AT_name("_reserved1")
    1393                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("_reserved1")
    1394                            .dwattr $C$DW$92, DW_AT_bit_offset(0x05)
    1395                            .dwattr $C$DW$92, DW_AT_bit_size(0x07)
    1396                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1398                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1399                            .dwattr $C$DW$92, DW_AT_decl_line(0x107)
    1400                            .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1401                    
    1402                    $C$DW$93        .dwtag  DW_TAG_member
    1403                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$28)
    1404                            .dwattr $C$DW$93, DW_AT_name("Q")
    1405                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("Q")
    1406                            .dwattr $C$DW$93, DW_AT_bit_offset(0x04)
    1407                            .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1408                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1410                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1411                            .dwattr $C$DW$93, DW_AT_decl_line(0x108)
    1412                            .dwattr $C$DW$93, DW_AT_decl_column(0x0e)
    1413                    
    1414                    $C$DW$94        .dwtag  DW_TAG_member
    1415                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$28)
    1416                            .dwattr $C$DW$94, DW_AT_name("V")
    1417                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("V")
    1418                            .dwattr $C$DW$94, DW_AT_bit_offset(0x03)
    1419                            .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1420                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1422                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1423                            .dwattr $C$DW$94, DW_AT_decl_line(0x109)
    1424                            .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1425                    
    1426                    $C$DW$95        .dwtag  DW_TAG_member
    1427                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$28)
    1428                            .dwattr $C$DW$95, DW_AT_name("C")
    1429                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("C")
    1430                            .dwattr $C$DW$95, DW_AT_bit_offset(0x02)
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1431                            .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1432                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1434                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1435                            .dwattr $C$DW$95, DW_AT_decl_line(0x10a)
    1436                            .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1437                    
    1438                    $C$DW$96        .dwtag  DW_TAG_member
    1439                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
    1440                            .dwattr $C$DW$96, DW_AT_name("Z")
    1441                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("Z")
    1442                            .dwattr $C$DW$96, DW_AT_bit_offset(0x01)
    1443                            .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1444                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1446                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1447                            .dwattr $C$DW$96, DW_AT_decl_line(0x10b)
    1448                            .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1449                    
    1450                    $C$DW$97        .dwtag  DW_TAG_member
    1451                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
    1452                            .dwattr $C$DW$97, DW_AT_name("N")
    1453                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("N")
    1454                            .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    1455                            .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1456                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1458                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1459                            .dwattr $C$DW$97, DW_AT_decl_line(0x10c)
    1460                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1461                    
    1462                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1463                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x104)
    1464                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    1465                            .dwendtag $C$DW$T$29
    1466                    
    1467                    
    1468                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1469                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1470                    $C$DW$98        .dwtag  DW_TAG_member
    1471                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$28)
    1472                            .dwattr $C$DW$98, DW_AT_name("ISR")
    1473                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("ISR")
    1474                            .dwattr $C$DW$98, DW_AT_bit_offset(0x17)
    1475                            .dwattr $C$DW$98, DW_AT_bit_size(0x09)
    1476                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1477                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1478                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1479                            .dwattr $C$DW$98, DW_AT_decl_line(0x12c)
    1480                            .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1481                    
    1482                    $C$DW$99        .dwtag  DW_TAG_member
    1483                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
    1484                            .dwattr $C$DW$99, DW_AT_name("_reserved0")
    1485                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("_reserved0")
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1486                            .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
    1487                            .dwattr $C$DW$99, DW_AT_bit_size(0x17)
    1488                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1490                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1491                            .dwattr $C$DW$99, DW_AT_decl_line(0x12d)
    1492                            .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1493                    
    1494                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1495                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x12b)
    1496                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    1497                            .dwendtag $C$DW$T$30
    1498                    
    1499                    
    1500                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1501                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1502                    $C$DW$100       .dwtag  DW_TAG_member
    1503                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$28)
    1504                            .dwattr $C$DW$100, DW_AT_name("ISR")
    1505                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("ISR")
    1506                            .dwattr $C$DW$100, DW_AT_bit_offset(0x17)
    1507                            .dwattr $C$DW$100, DW_AT_bit_size(0x09)
    1508                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1510                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1511                            .dwattr $C$DW$100, DW_AT_decl_line(0x13e)
    1512                            .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1513                    
    1514                    $C$DW$101       .dwtag  DW_TAG_member
    1515                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$28)
    1516                            .dwattr $C$DW$101, DW_AT_name("_reserved0")
    1517                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("_reserved0")
    1518                            .dwattr $C$DW$101, DW_AT_bit_offset(0x16)
    1519                            .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1520                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1521                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1522                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1523                            .dwattr $C$DW$101, DW_AT_decl_line(0x13f)
    1524                            .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1525                    
    1526                    $C$DW$102       .dwtag  DW_TAG_member
    1527                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$28)
    1528                            .dwattr $C$DW$102, DW_AT_name("ICI_IT_1")
    1529                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("ICI_IT_1")
    1530                            .dwattr $C$DW$102, DW_AT_bit_offset(0x10)
    1531                            .dwattr $C$DW$102, DW_AT_bit_size(0x06)
    1532                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1533                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1534                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1535                            .dwattr $C$DW$102, DW_AT_decl_line(0x140)
    1536                            .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1537                    
    1538                    $C$DW$103       .dwtag  DW_TAG_member
    1539                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
    1540                            .dwattr $C$DW$103, DW_AT_name("GE")
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1541                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("GE")
    1542                            .dwattr $C$DW$103, DW_AT_bit_offset(0x0c)
    1543                            .dwattr $C$DW$103, DW_AT_bit_size(0x04)
    1544                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1546                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1547                            .dwattr $C$DW$103, DW_AT_decl_line(0x141)
    1548                            .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1549                    
    1550                    $C$DW$104       .dwtag  DW_TAG_member
    1551                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$28)
    1552                            .dwattr $C$DW$104, DW_AT_name("_reserved1")
    1553                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("_reserved1")
    1554                            .dwattr $C$DW$104, DW_AT_bit_offset(0x08)
    1555                            .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1556                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1557                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1558                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1559                            .dwattr $C$DW$104, DW_AT_decl_line(0x142)
    1560                            .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1561                    
    1562                    $C$DW$105       .dwtag  DW_TAG_member
    1563                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    1564                            .dwattr $C$DW$105, DW_AT_name("T")
    1565                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("T")
    1566                            .dwattr $C$DW$105, DW_AT_bit_offset(0x07)
    1567                            .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1568                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1570                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1571                            .dwattr $C$DW$105, DW_AT_decl_line(0x143)
    1572                            .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1573                    
    1574                    $C$DW$106       .dwtag  DW_TAG_member
    1575                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$28)
    1576                            .dwattr $C$DW$106, DW_AT_name("ICI_IT_2")
    1577                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("ICI_IT_2")
    1578                            .dwattr $C$DW$106, DW_AT_bit_offset(0x05)
    1579                            .dwattr $C$DW$106, DW_AT_bit_size(0x02)
    1580                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1582                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1583                            .dwattr $C$DW$106, DW_AT_decl_line(0x144)
    1584                            .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1585                    
    1586                    $C$DW$107       .dwtag  DW_TAG_member
    1587                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$28)
    1588                            .dwattr $C$DW$107, DW_AT_name("Q")
    1589                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("Q")
    1590                            .dwattr $C$DW$107, DW_AT_bit_offset(0x04)
    1591                            .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1592                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1594                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1595                            .dwattr $C$DW$107, DW_AT_decl_line(0x145)
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1596                            .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1597                    
    1598                    $C$DW$108       .dwtag  DW_TAG_member
    1599                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
    1600                            .dwattr $C$DW$108, DW_AT_name("V")
    1601                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("V")
    1602                            .dwattr $C$DW$108, DW_AT_bit_offset(0x03)
    1603                            .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1604                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1606                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1607                            .dwattr $C$DW$108, DW_AT_decl_line(0x146)
    1608                            .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1609                    
    1610                    $C$DW$109       .dwtag  DW_TAG_member
    1611                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$28)
    1612                            .dwattr $C$DW$109, DW_AT_name("C")
    1613                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("C")
    1614                            .dwattr $C$DW$109, DW_AT_bit_offset(0x02)
    1615                            .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1616                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1618                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1619                            .dwattr $C$DW$109, DW_AT_decl_line(0x147)
    1620                            .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1621                    
    1622                    $C$DW$110       .dwtag  DW_TAG_member
    1623                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$28)
    1624                            .dwattr $C$DW$110, DW_AT_name("Z")
    1625                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("Z")
    1626                            .dwattr $C$DW$110, DW_AT_bit_offset(0x01)
    1627                            .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1628                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1630                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1631                            .dwattr $C$DW$110, DW_AT_decl_line(0x148)
    1632                            .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    1633                    
    1634                    $C$DW$111       .dwtag  DW_TAG_member
    1635                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$28)
    1636                            .dwattr $C$DW$111, DW_AT_name("N")
    1637                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("N")
    1638                            .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1639                            .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1640                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1642                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1643                            .dwattr $C$DW$111, DW_AT_decl_line(0x149)
    1644                            .dwattr $C$DW$111, DW_AT_decl_column(0x0e)
    1645                    
    1646                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1647                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x13d)
    1648                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    1649                            .dwendtag $C$DW$T$31
    1650                    
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1651                    
    1652                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1653                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    1654                    $C$DW$112       .dwtag  DW_TAG_member
    1655                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$28)
    1656                            .dwattr $C$DW$112, DW_AT_name("nPRIV")
    1657                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("nPRIV")
    1658                            .dwattr $C$DW$112, DW_AT_bit_offset(0x1f)
    1659                            .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1660                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1661                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1662                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1663                            .dwattr $C$DW$112, DW_AT_decl_line(0x175)
    1664                            .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    1665                    
    1666                    $C$DW$113       .dwtag  DW_TAG_member
    1667                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$28)
    1668                            .dwattr $C$DW$113, DW_AT_name("SPSEL")
    1669                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("SPSEL")
    1670                            .dwattr $C$DW$113, DW_AT_bit_offset(0x1e)
    1671                            .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1672                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1673                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1674                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1675                            .dwattr $C$DW$113, DW_AT_decl_line(0x176)
    1676                            .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    1677                    
    1678                    $C$DW$114       .dwtag  DW_TAG_member
    1679                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$28)
    1680                            .dwattr $C$DW$114, DW_AT_name("FPCA")
    1681                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("FPCA")
    1682                            .dwattr $C$DW$114, DW_AT_bit_offset(0x1d)
    1683                            .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1684                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1686                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1687                            .dwattr $C$DW$114, DW_AT_decl_line(0x177)
    1688                            .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    1689                    
    1690                    $C$DW$115       .dwtag  DW_TAG_member
    1691                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$28)
    1692                            .dwattr $C$DW$115, DW_AT_name("_reserved0")
    1693                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("_reserved0")
    1694                            .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1695                            .dwattr $C$DW$115, DW_AT_bit_size(0x1d)
    1696                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1698                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1699                            .dwattr $C$DW$115, DW_AT_decl_line(0x178)
    1700                            .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    1701                    
    1702                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1703                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x174)
    1704                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1705                            .dwendtag $C$DW$T$32
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1706                    
    1707                    
    1708                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1709                            .dwattr $C$DW$T$39, DW_AT_byte_size(0xe04)
    1710                    $C$DW$116       .dwtag  DW_TAG_member
    1711                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$34)
    1712                            .dwattr $C$DW$116, DW_AT_name("ISER")
    1713                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("ISER")
    1714                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1716                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1717                            .dwattr $C$DW$116, DW_AT_decl_line(0x196)
    1718                            .dwattr $C$DW$116, DW_AT_decl_column(0x12)
    1719                    
    1720                    $C$DW$117       .dwtag  DW_TAG_member
    1721                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$35)
    1722                            .dwattr $C$DW$117, DW_AT_name("RESERVED0")
    1723                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("RESERVED0")
    1724                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1725                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1726                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1727                            .dwattr $C$DW$117, DW_AT_decl_line(0x197)
    1728                            .dwattr $C$DW$117, DW_AT_decl_column(0x12)
    1729                    
    1730                    $C$DW$118       .dwtag  DW_TAG_member
    1731                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$34)
    1732                            .dwattr $C$DW$118, DW_AT_name("ICER")
    1733                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("ICER")
    1734                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1735                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1736                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1737                            .dwattr $C$DW$118, DW_AT_decl_line(0x198)
    1738                            .dwattr $C$DW$118, DW_AT_decl_column(0x12)
    1739                    
    1740                    $C$DW$119       .dwtag  DW_TAG_member
    1741                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$35)
    1742                            .dwattr $C$DW$119, DW_AT_name("RSERVED1")
    1743                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("RSERVED1")
    1744                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1745                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1746                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1747                            .dwattr $C$DW$119, DW_AT_decl_line(0x199)
    1748                            .dwattr $C$DW$119, DW_AT_decl_column(0x12)
    1749                    
    1750                    $C$DW$120       .dwtag  DW_TAG_member
    1751                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$34)
    1752                            .dwattr $C$DW$120, DW_AT_name("ISPR")
    1753                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("ISPR")
    1754                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1755                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1756                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1757                            .dwattr $C$DW$120, DW_AT_decl_line(0x19a)
    1758                            .dwattr $C$DW$120, DW_AT_decl_column(0x12)
    1759                    
    1760                    $C$DW$121       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1761                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$35)
    1762                            .dwattr $C$DW$121, DW_AT_name("RESERVED2")
    1763                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("RESERVED2")
    1764                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1765                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1766                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1767                            .dwattr $C$DW$121, DW_AT_decl_line(0x19b)
    1768                            .dwattr $C$DW$121, DW_AT_decl_column(0x12)
    1769                    
    1770                    $C$DW$122       .dwtag  DW_TAG_member
    1771                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$34)
    1772                            .dwattr $C$DW$122, DW_AT_name("ICPR")
    1773                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("ICPR")
    1774                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1775                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1776                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1777                            .dwattr $C$DW$122, DW_AT_decl_line(0x19c)
    1778                            .dwattr $C$DW$122, DW_AT_decl_column(0x12)
    1779                    
    1780                    $C$DW$123       .dwtag  DW_TAG_member
    1781                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$35)
    1782                            .dwattr $C$DW$123, DW_AT_name("RESERVED3")
    1783                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("RESERVED3")
    1784                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1785                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1786                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1787                            .dwattr $C$DW$123, DW_AT_decl_line(0x19d)
    1788                            .dwattr $C$DW$123, DW_AT_decl_column(0x12)
    1789                    
    1790                    $C$DW$124       .dwtag  DW_TAG_member
    1791                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$34)
    1792                            .dwattr $C$DW$124, DW_AT_name("IABR")
    1793                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("IABR")
    1794                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1795                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1796                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1797                            .dwattr $C$DW$124, DW_AT_decl_line(0x19e)
    1798                            .dwattr $C$DW$124, DW_AT_decl_column(0x12)
    1799                    
    1800                    $C$DW$125       .dwtag  DW_TAG_member
    1801                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$36)
    1802                            .dwattr $C$DW$125, DW_AT_name("RESERVED4")
    1803                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("RESERVED4")
    1804                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1805                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1806                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1807                            .dwattr $C$DW$125, DW_AT_decl_line(0x19f)
    1808                            .dwattr $C$DW$125, DW_AT_decl_column(0x12)
    1809                    
    1810                    $C$DW$126       .dwtag  DW_TAG_member
    1811                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$37)
    1812                            .dwattr $C$DW$126, DW_AT_name("IP")
    1813                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("IP")
    1814                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1815                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1816                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1817                            .dwattr $C$DW$126, DW_AT_decl_line(0x1a0)
    1818                            .dwattr $C$DW$126, DW_AT_decl_column(0x12)
    1819                    
    1820                    $C$DW$127       .dwtag  DW_TAG_member
    1821                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$38)
    1822                            .dwattr $C$DW$127, DW_AT_name("RESERVED5")
    1823                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("RESERVED5")
    1824                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1825                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1826                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1827                            .dwattr $C$DW$127, DW_AT_decl_line(0x1a1)
    1828                            .dwattr $C$DW$127, DW_AT_decl_column(0x12)
    1829                    
    1830                    $C$DW$128       .dwtag  DW_TAG_member
    1831                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$33)
    1832                            .dwattr $C$DW$128, DW_AT_name("STIR")
    1833                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("STIR")
    1834                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1835                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1836                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1837                            .dwattr $C$DW$128, DW_AT_decl_line(0x1a2)
    1838                            .dwattr $C$DW$128, DW_AT_decl_column(0x12)
    1839                    
    1840                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1841                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x195)
    1842                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    1843                            .dwendtag $C$DW$T$39
    1844                    
    1845                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    1846                            .dwattr $C$DW$T$176, DW_AT_name("NVIC_Type")
    1847                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$39)
    1848                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    1849                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1850                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x1a3)
    1851                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x04)
    1852                    
    1853                    
    1854                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1855                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x8c)
    1856                    $C$DW$129       .dwtag  DW_TAG_member
    1857                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$40)
    1858                            .dwattr $C$DW$129, DW_AT_name("CPUID")
    1859                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("CPUID")
    1860                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1862                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1863                            .dwattr $C$DW$129, DW_AT_decl_line(0x1b8)
    1864                            .dwattr $C$DW$129, DW_AT_decl_column(0x12)
    1865                    
    1866                    $C$DW$130       .dwtag  DW_TAG_member
    1867                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$33)
    1868                            .dwattr $C$DW$130, DW_AT_name("ICSR")
    1869                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("ICSR")
    1870                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1871                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1872                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1873                            .dwattr $C$DW$130, DW_AT_decl_line(0x1b9)
    1874                            .dwattr $C$DW$130, DW_AT_decl_column(0x12)
    1875                    
    1876                    $C$DW$131       .dwtag  DW_TAG_member
    1877                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$33)
    1878                            .dwattr $C$DW$131, DW_AT_name("VTOR")
    1879                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("VTOR")
    1880                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1881                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1882                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1883                            .dwattr $C$DW$131, DW_AT_decl_line(0x1ba)
    1884                            .dwattr $C$DW$131, DW_AT_decl_column(0x12)
    1885                    
    1886                    $C$DW$132       .dwtag  DW_TAG_member
    1887                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$33)
    1888                            .dwattr $C$DW$132, DW_AT_name("AIRCR")
    1889                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("AIRCR")
    1890                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1891                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1892                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1893                            .dwattr $C$DW$132, DW_AT_decl_line(0x1bb)
    1894                            .dwattr $C$DW$132, DW_AT_decl_column(0x12)
    1895                    
    1896                    $C$DW$133       .dwtag  DW_TAG_member
    1897                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$33)
    1898                            .dwattr $C$DW$133, DW_AT_name("SCR")
    1899                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("SCR")
    1900                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1901                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1902                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1903                            .dwattr $C$DW$133, DW_AT_decl_line(0x1bc)
    1904                            .dwattr $C$DW$133, DW_AT_decl_column(0x12)
    1905                    
    1906                    $C$DW$134       .dwtag  DW_TAG_member
    1907                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$33)
    1908                            .dwattr $C$DW$134, DW_AT_name("CCR")
    1909                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("CCR")
    1910                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1911                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1912                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1913                            .dwattr $C$DW$134, DW_AT_decl_line(0x1bd)
    1914                            .dwattr $C$DW$134, DW_AT_decl_column(0x12)
    1915                    
    1916                    $C$DW$135       .dwtag  DW_TAG_member
    1917                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$41)
    1918                            .dwattr $C$DW$135, DW_AT_name("SHP")
    1919                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("SHP")
    1920                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1921                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1922                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1923                            .dwattr $C$DW$135, DW_AT_decl_line(0x1be)
    1924                            .dwattr $C$DW$135, DW_AT_decl_column(0x12)
    1925                    
TI ARM Assembler PC v16.9.6 Wed Nov 02 14:57:38 2022

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   36

    1926                    $C$DW$136       .dwtag  DW_TAG_member
    1927                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$33)
    1928                            .dwattr $C$DW$136, DW_AT_name("SHCSR")
    1929                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("SHCSR")
    1930                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1931                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1932                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1933                            .dwattr $C$DW$136, DW_AT_decl_line(0x1bf)
    1934                            .dwattr $C$DW$136, DW_AT_decl_column(0x12)
    1935                    
    1936                    $C$DW$137       .dwtag  DW_TAG_member
    1937                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$33)
    1938                            .dwattr $C$DW$137, DW_AT_name("CFSR")
    1939                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("CFSR")
    1940                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1941                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1942                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1943                            .dwattr $C$DW$137, DW_AT_decl_line(0x1c0)
    1944                            .dwattr $C$DW$137, DW_AT_decl_column(0x12)
    1945                    
    1946                    $C$DW$138       .dwtag  DW_TAG_member
    1947                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$33)
    1948                            .dwattr $C$DW$138, DW_AT_name("HFSR")
    1949                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("HFSR")
    1950                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1951                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1952                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1953                            .dwattr $C$DW$138, DW_AT_decl_line(0x1c1)
    1954                            .dwattr $C$DW$138, DW_AT_decl_column(0x12)
    1955                    
    1956                    $C$DW$139       .dwtag  DW_TAG_member
    1957                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$33)
    1958                            .dwattr $C$DW$139, DW_AT_name("DFSR")
    1959                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("DFSR")
    1960                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1961                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1962                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1963                            .dwattr $C$DW$139, DW_AT_decl_line(0x1c2)
    1964                            .dwattr $C$DW$139, DW_AT_decl_column(0x12)
    1965                    
    1966                    $C$DW$140       .dwtag  DW_TAG_member
    1967                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$33)
    1968                            .dwattr $C$DW$140, DW_AT_name("MMFAR")
    1969                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("MMFAR")
    1970                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1971                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1972                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1973                            .dwattr $C$DW$140, DW_AT_decl_line(0x1c3)
    1974                            .dwattr $C$DW$140, DW_AT_decl_column(0x12)
    1975                    
